--[[-- Creador del Script: @AlohYT | Juego: Payback2 [ 2.106.X ]
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠛⠉⠀⢠⡄⠀⠙⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠉⠀⠠⠂⠀⣰⡏⠀⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⢀⠇⠀⢠⡿⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠨⠀⠀⡾⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⡃⠀⠘⠁⠀⠀⠀⢀⣀⣀⣀⠀⡀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⡄⠀⢰⣿⡿⢉⠀⠀⠈⠉⠉⠉⠉⠉⠉⠙⠛⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣦⣿⣯⣧⣼⠀⠀⣤⡀⣀⢀⡀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⠏⠀⠀⣿⣿⣿⣿⣿⣿⣿⡌⣴⣾⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡉⠛⠛⠟⠁⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣇⠈⠉⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡆⠀⢹⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡇⠀⠰⣀⠀⠀⠀⠀⠘⠻⠿⣿⣿⣿⣿⣿⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣷⡄⣦⣿⣆⠀⠀⠀⠀⠀⠀⢠⠙⠛⠻⠿⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣽⣿⣿⣧⣥⡀⠀⠀⠀⠎⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⠁⠀⠀⠀⠐⠀⣀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⡟⠀⢠⣴⣶⣦⣤⣤⣄⣠⣠⣤⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢛⠁⠉⢿⠃⠘⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠆⠀⠀⠀⠀⠲⢀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣷⣶⣤⣤⣄⠀⠀⠀⠀⠃⢀⠀⣄⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣛⠁⢿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠐⠀⠀⠀⡀⠄⠈⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⢠⠁⠀⠀⠀⠀⠀⠀⠀⠀⢀⣺⣿⣿⠀⠈⠻⣿⣿⣍⠳⣤⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⡇⠈⠀⠀⠀⠀⠀⠠⠀⠀⠀⣼⣿⣾⡟⠸⠀⣀⣄⡁⣴⣶⣌⣙⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠁⠄⠀⠀⠀⢠⣴⡟⠂⠀⢰⣿⣇⣙⠛⠐⠀⣿⡟⢻⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠐⠀⠠⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⢀⠀⠀⢸⣶⡿⠋⠀⠀⠀⢘⣛⣻⣿⣶⠬⠀⠛⠳⣾⣿⣿⣿⠏⠀⠀⠀⠀⢀⣄⡀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠈⠀⠀⣸⠇⠀⠀⠀⠀⠀⢻⢿⣿⣿⣄⣤⣀⣴⣦⣽⣿⣿⡏⠀⠀⠀⠀⢀⣿⣿⣿⣶⡄⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⣾⣿⣿⣿⡿⡑⠦⡀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠁⡧⠀⠀⠀⠀⠀⠀⡀⠄⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⠀⡶⢹⣷⣄⠀⠀⠀⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⡀⠀⠀⠀⠀⠀⠠⠀⠀⡀⠀⠀⠹⣿⣿⣿⡿⣿⣿⣿⣿⣷⣶⣶⣶⣶⣾⣿⣿⣿⣿⢿⣵⣷⠈⣿⣿⣷⣄⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⠁⠀⠀⠀⠀⠂⠀⠄⢀⠀⠐⠀⡀⠈⠻⠿⣿⣮⣙⡿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠋⣵⣿⡿⠋⠀⠈⢿⣿⣿⣷⣆⣀⠀⠀⠈⠉⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣦⡁⠠⢀⠀⠀⠀⠀⠂⠀⠄⠀⡀⠀⠀⠀⠈⠛⠿⣿⣶⣶⣬⠿⣿⣿⢩⣷⡾⠿⠟⠋⠁⠀⢀⡠⠈⠛⢿⣿⣿⣿⣿⣦⡀⠘⢦⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣷⣦⣌⡐⠠⠄⣀⠈⠀⠀⠀⠐⠀⠁⠀⠀⠀⠀⠀⠀⠉⠈⠉⠉⠁⠁⠀⠀⠀⣠⣴⣶⡄⠉⢀⣤⣾⣿⣿⣿⣿⣿⣿⣦⡀⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣷⣶⣤⣬⣀⡀⠐⠀⠠⠠⠤⠀⠀⠤⠠⠀⠀⠀⢀⡀⣤⠤⣴⡾⠷⠈⠃⣉⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣷⣾⣿⣿⣟⣿⡇⠿⣿⣿⣇⣿⡇⣸⣶⡯⡚⣿⣷⣀⠻⠟⢃⣈⣿⣷⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⠁⠉⠁⠉⠁⠀⠉⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠙⢿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠙⢿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠈⠀⠐⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠙⢿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠙⢿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⢀⣽
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⣴⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⣼⣿⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⣴⣿⣿⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⢰⣿⣿⣿⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
]]

function Pistola()
gg.clearResults()
gg.setRanges(16 | 32)
gg.toast("Pon Pistola")
gg.sleep(1111)
gg.searchNumber("13", 4)
gg.toast("Pon Cuchillo")
gg.sleep(1111)
gg.refineNumber("0", 4)
gg.toast("Pon Pistola")
gg.sleep(1111)
gg.refineNumber("13", 4)
end

activa = 1
function MENU()
local opciones = {
"$125k",
"$250k",
"$500k",
"$1M",
"$2M",
"$3M",
"$4M",
"$5M",
"$10M",
"$1B",
"$-1B",
"$???",
"$Random",
"Modo Desmadre Modificado [ Definible ]",
"Reiniciar [$0]",
"【✘】 Finalizar Script :D 【✘】"
}
local tienda = gg.choice(opciones,-1,
"Script Hecho Por: XxBlackIstAlohxX _MKNV_ (Alias: Aloh)")
if not tienda or tienda == nil or tienda == 0 then
gg.toast('Script Ocultado!\n       ❤️XxAlohxX❤️')
elseif tienda == #opciones then
gg.setVisible(true)
gg.clearResults()
print( "\n\nScript Elaborado Por Tu Amor: XxAlohxX (XD)...\nSuscribete a mi canal Capo Bv (❤️💕 @BlackIstAloh 💕❤)️" )
print( "El script se Ha Abortdao exitosamente :D | Gracias Por su atencion... <3 " )
print( "-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------" )
print(os.date("Cancelacion de Script: (Fecha) %d.%m.%Y (Tiempo) %H:%M:%S"))
gg.alert(" Script Aborted...\nEspero haiga tenido una Buena Experiencia usando mi Script ;D\
----------------------------------------------------------------------------------------\
Hope You Had a Good Experience using my Script ;D\n\nAutor: 😎 -Aloh 😎")
os.exit()
else
gg.processResume()
if tienda == 1 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 125000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("125k")
gg.sleep(900)
end
if tienda == 2 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 250000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("250k")
gg.sleep(900)
end
if tienda == 3 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 500000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("500k")
gg.sleep(900)
end
if tienda == 4 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 1000000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("1 Millon")
gg.sleep(900)
end
if tienda == 5 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 2000000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("2 Millones")
gg.sleep(900)
end
if tienda == 6 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 3000000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("3 Millones")
gg.sleep(900)
end
if tienda == 7 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 4000000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("4 Millones")
gg.sleep(900)
end
if tienda == 8 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 5000000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("5 Millones")
gg.sleep(900)
end
if tienda == 9 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 10000000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("10 Millones")
gg.sleep(900)
end
if tienda == 10 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 1000000000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("1 Billon")
gg.sleep(900)
end
if tienda == 11 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = -1000000000
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("1 Billon")
gg.sleep(900)
end
if tienda == 12 then
local bucle1 = {
10000000,
999999,
4,
917862575,
125000,
-125000,
-52428800,
250000,
-250000,
1140457472,
500000,
15663231,
-500000,
1001000,
2222222,
5050505,
1000000000,
13,
0,
13,
-7,
90000000,
917862575,
10101010,
-999999999,
}
local bucle2 = {
7,
666,
0,
7,
0,
7,
0,
7,
0,
7,
0,
7,
5,
0,
5,
-718276319,
7,
2934271,
0,
-123456789,
38,
-20080214,
2013000,
2014000,
2015000,
2016000,
2017000,
2018000,
2019000,
2020000,
2021000,
2022000,
2023000,
2999000,
-666,
-999,
-666,
-886262945,
4294967295,
}
Pistola()
for i, v in ipairs(bucle1) do
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = v
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("?????????????????????????????")
gg.sleep(500)
end
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 0
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("?????????????????????????????")
gg.sleep(4000)
gg.toast("\n Inglish: You Think...\n Español: Tu Crees...")
gg.sleep(3500)
gg.toast("\n Inglish: That This...\n Español: Que esto...")
gg.sleep(3500)
gg.toast("...")
gg.sleep(4000)
gg.toast("\n Inglish: Is The End?\n Español: Es el Fin?")
gg.sleep(1500)
gg.toast("?????????????????????????????")
gg.sleep(500)
for i, v in ipairs(bucle2) do
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = v
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("?????????????????????????????")
gg.sleep(500)
end
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 0
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("????Ya????Done????Ya????")
gg.sleep(500)
end
if tienda == 13 then
local seed = os.time() ~ math.random(0,0x7FFFFFFF)
local function AlohYT()
seed = seed ~ (seed << 13) & 0xFFFFFFFF
seed = seed ~ (seed >> 17) & 0xFFFFFFFF
seed = seed ~ (seed << 5)  & 0xFFFFFFFF
return seed & 0x7FFFFFFF
end
local function randomNumber()
local num = AlohYT()
if math.random(0,1) == 0 then
num = -num
end
return num
end
local aloh = randomNumber() -- Genera un numero entre -2147483647 y 2147483647
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = aloh
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("Random!")
gg.sleep(900)
end
if tienda == 14 then
local txt = {
{"Put | Coloca The Big Freeze\nComo Mapa a Jugar", "6"},
{"Put | Coloca Destra City\nComo Mapa a Jugar", "3"},
{"Put | Coloca The Big Freeze\nComo Mapa a Jugar", "6"},
}
function loop()
for i = 1, 3 do
gg.toast(4 - i)
gg.sleep(500)
end
end
gg.clearResults()
gg.setRanges(16 | 32)
gg.toast(txt[1][1])
gg.sleep(3200)
loop()
gg.searchNumber(txt[1][2], 4)
gg.toast(txt[2][1])
gg.sleep(3200)
loop()
gg.refineNumber(txt[2][2], 4)
gg.toast(txt[3][1])
gg.sleep(3200)
loop()
gg.refineNumber(txt[3][2], 4)
w = gg.getResults(1)
local q = {}  
q[1] = {}
q[1].address = w[1].address + 0x4
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 8
q[1].freeze = false
q[2] = {}
q[2].address = w[1].address + 0x34
q[1].flags = 4
q[1].name = "@AlohYT"
q[2].value = -7
q[2].freeze = true
gg.setValues(q)
gg.addListItems(q)
gg.clearResults()
gg.toast("No Money Limit")
gg.sleep(900)
end
if tienda == 15 then
Pistola()
w = gg.getResults(1)
local q = {}
q[1] = {}
q[1].address = w[1].address + 0x18
q[1].flags = 4
q[1].name = "@AlohYT"
q[1].value = 0
q[1].freeze = false
gg.setValues(q)
gg.addListItems(q)
gg.toast("Bancarrota :0")
gg.sleep(900)
end
end
gg.processResume()
XxAlohxX = -1
end

while true do
if gg.isVisible(true) then
XxAlohxX = 1 
gg.setVisible(false)
end
if XxAlohxX == 1 then MENU() end
end